{
  "version": "https://jsonfeed.org/version/1",
  "title": "WorldQL",
  "home_page_url": "https://www.worldql.com/",
  "feed_url": "https://www.worldql.com/feed/feed.json",
  "description": "The spatial database for building real-time multiplayer games",
  "author": {
    "name": "WorldQL Team",
    "url": "https://www.worldql.com/about/"
  },
  "items": [{
      "id": "https://www.worldql.com/posts/2021-08-worldql-scalable-minecraft/",
      "url": "https://www.worldql.com/posts/2021-08-worldql-scalable-minecraft/",
      "title": "How we built an auto-scalable Minecraft server for 1000+ players using WorldQL&#39;s spatial database",
      "content_html": "<h2 id=\"minecraft's-multiplayer-performance-problems\">Minecraft's multiplayer performance problems <a class=\"direct-link\" href=\"#minecraft's-multiplayer-performance-problems\">#</a></h2>\n<p>Minecraft's server software is single-threaded, meaning it must process all events in the world sequentially on a single CPU core.\nEven on the most powerful computers, a standard Minecraft server will struggle to keep up with over 200 players. Too many players attempting to load too much of the world will cause the server <a href=\"https://minecraft.fandom.com/wiki/Tick#Game_tick\">tick rate</a> to plummet to unplayable levels.\nYouTuber SalC1 made a <a href=\"https://www.youtube.com/watch?v=MBpN679o5Yk\">video</a> talking about this issue which has garnered nearly a million views.</p>\n<p>Back at the beginning of the 2020 quarantine I became interested in the idea of a supermassive Minecraft server, one with thousands of players unimpeded by lag.\nThis was not possible at the time due to the limitations of Minecraft's server software, so I decided to build a way to share player load across multiple server processes. I named this project &quot;Mammoth&quot;.</p>\n<p>My first attempt involved slicing the world into 1024 block-wide segments which were &quot;owned&quot; by different servers. Areas near the borders were synchronized and ridden entities such as horses or boats would be transferred across servers. <a href=\"https://youtu.be/Q1RXHS4N6wg?t=60\">Here's a video on how it worked</a>. This technique is no longer used; the Minecraft world is no longer sliced up by area.</p>\n<p>It was a neat proof-of-concept, but it had some pretty serious issues.\nPlayers couldn't see each other across servers or interact. There was a jarring reconnect whenever crossing server borders.\nIf one server was knocked offline, certain regions of the world became completely inaccessible. It had no way to mitigate lots of players in one area, meaning large-scale PvP was impossible. The experience simply wasn't great.</p>\n<p>To actually solve the problem, something more robust was needed. I set the following goals:</p>\n<ul>\n<li>Players must be able to see each other, even if on different server processes.</li>\n<li>Players must be able to engage in combat across servers.</li>\n<li>When a player places a block or updates a sign, it should be immediately visible to all other players.</li>\n<li>If one server is down, the entire world should still be accessible.</li>\n<li>If needed, servers can be added or removed at-will to adapt to the amount of players.</li>\n</ul>\n<p>To accomplish this, the world state needed to be stored in a central database and served to Minecraft servers as they popped in and out of existence.\nThere also needed to be a message-passing backend that allowed player movement packets to be forwarded between servers for cross-server visibility.</p>\n<h2 id=\"worldql-is-created\">WorldQL is created <a class=\"direct-link\" href=\"#worldql-is-created\">#</a></h2>\n<p>While early versions of Mammoth used redis, I had some new requirements that my message passing and data storage backend needed:</p>\n<ul>\n<li>Fast messaging based on proximity, so I could send the right updates to the right Minecraft servers (which in turn send them to player clients)</li>\n<li>An efficient way to store and retrieve permanent world changes</li>\n<li>Real-time object tracking</li>\n</ul>\n<p>I couldn't find any existing product with these qualities. I found incomplete attempts to use SpatialOS for Minecraft scaling, and I considered using it for this project. However, their license turned me off.</p>\n<p>To meet these requirements, I started work on WorldQL. It's a real-time, scriptable spatial database built for multiplayer games.\nWorldQL can replace traditional game servers or be used to load balance existing ones.</p>\n<p>If you're a game developer or this just sounds interesting to you, please be sure to join <a href=\"https://discord.gg/tDZkXQPzEw\">our Discord server</a>.</p>\n<p>The new version of Mammoth uses WorldQL to store all permanent world changes and pass real-time player information (such as location) between servers.\nMinecraft game servers communicate with WorldQL using <a href=\"https://zeromq.org/\">ZeroMQ</a> TCP push/pull sockets.</p>\n<h2 id=\"mammoth's-architecture\">Mammoth's architecture <a class=\"direct-link\" href=\"#mammoth's-architecture\">#</a></h2>\n<p>Mammoth has three parts:</p>\n<ol>\n<li>Two or more Minecraft server hosts running Spigot-based server software</li>\n<li>WorldQL server</li>\n<li>BungeeCord proxy server (optional)</li>\n</ol>\n<p><img src=\"/img/mammoth-arch.png\" alt=\"WorldQL architecture diagram\"></p>\n<p>With this setup, a player can connect to <strong>any</strong> of the Minecraft servers and receive the same world and player data. Optionally, a server admin can choose to put the Minecraft servers behind a proxy, so they all share a single external IP/port.</p>\n<h2 id=\"part-1%3A-synchronizing-player-positions\">Part 1: Synchronizing player positions <a class=\"direct-link\" href=\"#part-1%3A-synchronizing-player-positions\">#</a></h2>\n<p>To broadcast player movement between servers, Mammoth uses WorldQL's location-based pub/sub messaging. This is a simple two-step process:</p>\n<ol>\n<li>Minecraft servers continuously report their players' locations to the WorldQL server.</li>\n<li>Servers receive update messages about players in locations they have loaded.</li>\n</ol>\n<p>Here's a video demo showing two players viewing and punching each other, despite being on different servers!</p>\n<video controls>\n    <source src=\"/img/minecraft-cross-server-pvp.mp4\" type=\"video/mp4\">\n</video>\n<p>The two Minecraft servers exchange real-time movement and combat events through WorldQL.\nFor example, when <em>Left Player</em> moves in front of <em>Right Player</em>:</p>\n<ol>\n<li><em>Left Player</em>'s Minecraft server sends an event containing their new location to WorldQL.</li>\n<li>Because <em>Left Player</em> is near <em>Right Player</em>, WorldQL sends a message to Right Player's server.</li>\n<li><em>Right Player</em>'s server receives the message and generates client-bound packets to make <em>Left Player</em> appear.</li>\n</ol>\n<h2 id=\"part-2%3A-synchronizing-blocks-and-the-world\">Part 2: Synchronizing blocks and the world <a class=\"direct-link\" href=\"#part-2%3A-synchronizing-blocks-and-the-world\">#</a></h2>\n<p>Mammoth tracks the authoritative version of the Minecraft world using WorldQL Records, a data structure designed for permanent world alterations.\nIn Mammoth, no single Minecraft server is responsible for storing the world. All block changes from the base seed are centrally stored in WorldQL. These changes are indexed by chunk coordinate and time, so a Minecraft server can request only the updates it needs since it last synced a chunk.</p>\n<p>Here's a video demonstrating real-time block synchronization between two servers. Complexities such as sign edits, compound blocks (like beds and doors) and nether portal creation all work properly.</p>\n<video controls>\n    <source src=\"/img/minecraft-cross-server-blocks.mp4\" type=\"video/mp4\">\n</video>\n<p>When a new Minecraft server is created, it &quot;catches up&quot; with the current version of the world. Prior to recording the video below, I built a cute desert home then <strong>completely deleted my Minecraft server's world files</strong>. It was able to quickly sync the world from WorldQL. Normally this happens automatically, but I triggered it using Mammoth's /refreshworld command so I can show you.</p>\n<video controls>\n  <source src=\"/img/minecraft-world-sync-catchup.mp4\" type=\"video/mp4\">\n</video>\n<p>This feature allows a Minecraft server to <strong>dynamically auto-scale</strong>; server instances can be created and destroyed to match demand.</p>\n<p>Mammoth's world synchronization is incomplete for the latest 1.17.1 update. We're planning to introduce redstone, hostile mob, and weapon support ASAP.</p>\n<h2 id=\"performance-gains\">Performance gains <a class=\"direct-link\" href=\"#performance-gains\">#</a></h2>\n<p>While still a work in progress, Mammoth offers considerable performance benefits over standard Minecraft servers. It's particularly good for handling very high player counts.</p>\n<p>Here's a demonstration showcasing 1000 cross-server players, this simulation is functionally identical to real cross-server player load. The server TPS never dips below 20 (perfect) and I'm running the whole thing on my laptop.</p>\n<p>These simulated players are created by a loopback process which:</p>\n<ol>\n<li>Receives WorldQL player movement queries.</li>\n<li>Modifies their location and name 1000 times and sends them back to the server.</li>\n</ol>\n<p>This stress test results in the player seeing a wall of copycats:</p>\n<video controls>\n  <source src=\"/img/mammoth-stress-test.mp4\" type=\"video/mp4\">\n</video>\n<p>Mammoth pushes Minecraft server performance further than ever and will enable entirely new massively-multiplayer experiences. Keep in mind this demo <strong>exists only to show off the efficiency of the message broker and packet code</strong>, this is not as stressing as 1000 real players connecting. Stay tuned for a demo featuring actual human player load.</p>\n<h2 id=\"coming-soon%3A-program-entire-minecraft-mini-games-inside-worldql-using-javascript\">Coming soon: Program entire Minecraft mini-games inside WorldQL using JavaScript <a class=\"direct-link\" href=\"#coming-soon%3A-program-entire-minecraft-mini-games-inside-worldql-using-javascript\">#</a></h2>\n<p>Powered by the V8 JavaScript engine, WorldQL's scripting environment allows you\nto develop Minecraft mini-games without compiling your own server plugin.\nThis means you don't have to restart or reload your server with every code change, allowing you to develop fast.</p>\n<p>As an added bonus, every Minecraft mini-game you write will be scalable across multiple servers, just like our &quot;vanilla&quot; experience.</p>\n<p>The process of developing Minecraft mini-games using WorldQL is very similar to using WorldQL to develop multiplayer for stand-alone titles. If you're interesting in\ntrying it out when it's ready, <a href=\"https://discord.gg/tDZkXQPzEw\">be sure to join our Discord to get updates first</a>.</p>\n<h2 id=\"conclusions\">Conclusions <a class=\"direct-link\" href=\"#conclusions\">#</a></h2>\n<p>Thanks for reading this article! Feel free to check out our <a href=\"https://github.com/WorldQL/mammoth\">GitHub repository for the Mammoth Minecraft server plugin</a> and <a href=\"https://discord.gg/tDZkXQPzEw\">join WorldQL's Discord</a>!</p>\n<h2 id=\"comments\">Comments</h2>\n<p><a href=\"https://www.reddit.com/r/gamedev/comments/pgoa7q/how_we_built_an_autoscalable_minecraft_server_for/\">/r/gamedev</a></p>\n",
      "date_published": "2021-09-02T00:00:00Z"
    }
  ]
}
